//
//  ErrorCode.m
//  YSApp
//
//  Created by 云盛科技 on 2016/12/12.
//  Copyright © 2016年 云盛科技. All rights reserved.
//

#import "ErrorCode.h"

@implementation ErrorCode
+(NSString *)initWithErrorCode:(NSString *)StrId{
    NSDictionary *dic = @{@"300301":@"内部错误"
                          ,@"300302":@"参数异常"
                          ,@"404":@"404 错误"
                          ,@"500":@"500 错误"
                          ,@"403":@"403 错误"
                          ,@"401":@"401 错误"
                          ,@"0":@"成功"
                          ,@"700":@"数据库数据执行发生未知错误"
                          ,@"701":@"可用资金不足"
                          ,@"702":@"登陆异常"
                          ,@"703":@"首次推广解锁成功标识"
                          ,@"704":@"实名认证失败"
                          ,@"705":@"银行卡号已经存在"
                          ,@"706":@"银行卡不存在"
                          ,@"707":@"用户无推广权利"
                          ,@"708":@"支付密码错误"
                          ,@"709":@"身份证号码错误"
                          ,@"710":@"生成订单信息错误"
                          ,@"711":@"保存临时订单错误"
                          ,@"712":@"微信支付获取临时订单错误"
                          ,@"713":@"支付密码错误"
                          ,@"714":@"手机号已经被注册"
                          ,@"715":@"手机号不合法"
                          ,@"716":@"未设置支付密码"
                          ,@"717":@"理财投资金额转出失败"
                          ,@"718":@"已领取"
                          ,@"719":@"名字不符合要求"
                          ,@"720":@"VB广告领取已经达到上限"
                          ,@"721":@"用户的收货地址为空"
                          ,@"722":@"短信每日次数限制"
                          ,@"723":@"二维码无效"
                          ,@"724":@"二维码已过期"
                          ,@"725":@"会员不存在"
                          ,@"726":@"不在粉丝列表中"
                          ,@"727":@"商家不存在"
                          ,@"728":@"商家未激活"
                          ,@"729":@"不支持该支付类型"
                          ,@"730":@"该用户已注册商店"
                          ,@"731":@"红包已经拆过了"
                          ,@"732":@"审批中"
                          ,@"733":@"没有获奖信息"
                          ,@"734":@"该用户未注册商店"
                          ,@"735":@"本地生活服务不存在"
                          ,@"736":@"本地生活服务购买限制"
                          ,@"737":@"本地生活服务使用限制"
                          ,@"738":@"本地生活订单不存在"
                          ,@"739":@"本地生活订单状态错误"
                          ,@"740":@"无权限发红包"
                          ,@"741":@"没有拆广告红包的权限"
                          ,@"742":@"广告红包无效范围"
                          ,@"743":@"广告红包已拆完"
                          ,@"744":@"当前用户已领取该广告红包"
                          ,@"745":@"广告红包已过期"
                          ,@"746":@"会员不允许发、接红包"
                          ,@"747":@"广告红包已禁用"
                          ,@"800":@"保存订单信息错误"
                          ,@"801":@"订单购买时金额不足"
                          ,@"802":@"订单购买时库存不足"
                          ,@"803":@"购买次数限制"
                          ,@"804":@"活动未开始"
                          ,@"805":@"活动已结束"
                          ,@"806":@"无可拆红包"
                          ,@"807":@"消费券不属于商家"};
    NSArray *arr = [dic allKeys];
    if([arr containsObject:StrId])
    {
        return [dic allValues][[arr indexOfObject:StrId]];
    }
    return 0;
}

@end
